Repository: beroset/cracklib
Catalog: src/po/*.po
Languages: fr

source: it is based on your username
fr: il est basé sur votre nom d'utilisateur

source: it is based upon your password entry
fr: il est basé sur votre mot de passe

source: it is derived from your password entry
fr: il est dérivé de votre mot de passe

source: it is derivable from your password entry
fr: il est dérivable de votre mot de passe

source: it's derivable from your password entry
fr: il est dérivable de votre mot de passe

source: you are not registered in the password file
fr: vous n'êtes pas enregistré(e) dans le fichier passwd

source: it is WAY too short
fr: il est BIEN TROP court

source: it is too short
fr: il est trop court

source: it does not contain enough DIFFERENT characters
fr: il ne contient pas suffisamment de caractères DIFFÉRENTS

source: it is all whitespace
fr: il ne contient que des espaces

source: it is too simplistic/systematic
fr: il est trop simple

source: it looks like a National Insurance number.
fr: il ressemble à un numéro de sécurité sociale.

source: it is based on a dictionary word
fr: il est basé sur un mot du dictionnaire

source: it is based on a (reversed) dictionary word
fr: il est basé sur un mot du dictionnaire (écrit à l'envers)

source: error loading dictionary
fr: erreur lors du chargement du dictionnaire
